"----------------------------------✅ 模式切换----------------------------------"


" 普通➡️可视
" v

" 普通➡️可视-行
" V

" 普通➡️可视-块
nnoremap <leader>v <C-v>

" ----------------------------------------------

" 普通➡️选择
" s

" 普通➡️选择-行
" S

" 普通➡️选择-块
nnoremap <leader>s <C-s>


" ----------------------------------------------

" 插入➡️替换

" ----------------------------------------------

" 插入➡️选择



" ----------------------------------------------


" 插入➡️普通
" the method `jj` maps to <Esc> sucks
" because `jj` is used for join the lines
"inoremap jj <Esc>
inoremap jk <ESC>
inoremap kj <Esc>
inoremap <leader>qQ <ESC>

" ----------------------------------------------

" 插入➡️命令行

" ----------------------------------------------

" 插入➡️可视

" ----------------------------------------------





" 可视➡️普通
vnoremap <leader>q <ESC>


" ----------------------------------------------

" 命令行➡️普通


